Joerg-66/ESP8266-WebMonitor/Software/WebMonitor_1-3/ESP_Settings.cpp
// Webserver auf Port 80 setzen
WiFiServer server(80);

void ESP_Settings::WebInterface(boolean bShowFullSite = true){
  String sDummy;
  int iDummy;
  boolean bSaveToEEPROM = false;

  if (bFirstRun == true){
    //server.serveStatic("/", SPIFFS, "/index.html"); // Die Abfrage auf die reine URL '/' wird auf '/index.html' umgelenkt
    server.begin();
    delay(100);
    bFirstRun = false;
  }

  
    yield();
    delay(10);
    WiFiClient client = server.available();   // Hört auf Anfragen von Clients
    
    if (client) {                             // Falls sich ein neuer Client verbindet,
      Serial.println("Neuer Client.");        // Ausgabe auf den seriellen Monitor
      String currentLine = "";                // erstelle einen String mit den eingehenden Daten vom Client
      
      while (client.connected()) {            // wiederholen so lange der Client verbunden ist
        if (client.available()) {             // Fall ein Byte zum lesen da ist,
          char c = client.read();             // lese das Byte, und dann
          Serial.write(c);                    // gebe es auf dem seriellen Monitor aus
          yield();
          HTTP_header += c;
          if (c == '\n') {                    // wenn das Byte eine Neue-Zeile Char ist
            // wenn die aktuelle Zeile leer ist, kamen 2 in folge.
            // dies ist das Ende der HTTP-Anfrage vom Client, also senden wir eine Antwort:
            if (currentLine.length() == 0) {
              // HTTP-Header fangen immer mit einem Response-Code an (z.B. HTTP/1.1 200 OK)
              // gefolgt vom Content-Type damit der Client weiss was folgt, gefolgt von einer Leerzeile:
              client.println("HTTP/1.1 200 OK");
              client.println("Content-type:text/html");
              client.println("Connection: close");
              client.println();
              
              sDummy = PickValue(HTTP_header, "SSID");
              sDummy = HTML_RemoveSpecialChar(sDummy);
              sDummy.toCharArray(cWifi_Name, sDummy.length()+1);
              if (sDummy.length() < 1) bValidInputLength01 = false; else bValidInputLength01 = true;
              bValidInput01 = HTML_noSpecialChar(sDummy);             // Überprüfung auf verbotene Sonderzeichen bei der SSID

              sDummy = PickValue(HTTP_header, "PASSPHRASE");
              sDummy.toCharArray(cWifi_Password, sDummy.length()+1);
              if (sDummy.length() < 8) bValidInputLength02 = false; else bValidInputLength02 = true;
              bValidInput02 = HTML_noSpecialChar(sDummy);             // Überprüfung auf Sonderzeichen
              
              sDummy = PickValue(HTTP_header, "TR064_USER");
              sDummy.toCharArray(cTR064_User, sDummy.length()+1);
              if (sDummy.length() == 0) bValidInputLength03 = false; else bValidInputLength03 = true;
              bValidInput03 = HTML_noSpecialChar(sDummy);             // Überprüfung auf Sonderzeichen

              sDummy = PickValue(HTTP_header, "TR064_PASSWORD");
              sDummy.toCharArray(cTR064_Password, sDummy.length()+1);
              if (sDummy.length() < 8) bValidInputLength04 = false; else bValidInputLength04 = true;
              bValidInput04 = HTML_noSpecialChar(sDummy);             // Überprüfung auf Sonderzeichen
              
//##########################################################
              Serial.begin(115200);
              sDummy = PickValue(HTTP_header, "DL_SPEED");
              Serial.println();
              Serial.print("Download Speed: ");
              Serial.println(sDummy);
              ulDL_Speed = abs(sDummy.toInt());
              ulDL_Speed = ulDL_Speed * 1000;
              Serial.print("Download Speed: ");
              Serial.println(ulDL_Speed);
              Serial.println();
              sDummy.toCharArray(cDL_Speed, sDummy.length()+1);

              sDummy = PickValue(HTTP_header, "UL_SPEED");
              ulUL_Speed = abs(sDummy.toInt());
              ulUL_Speed = ulUL_Speed * 1000;
              sDummy.toCharArray(cUL_Speed, sDummy.length()+1);      

               
//##########################################################
                  

              sDummy = PickValue(HTTP_header, "ACTION");
              iDummy = sDummy.toInt();
              if (iDummy == 0) sMessage = "";
              else{
                bSaveToEEPROM = false;
                if (bValidInput01 && bValidInput02 && bValidInput03 && bValidInput04) bValidInput = true; else bValidInput = false;
                if (bValidInputLength01 && bValidInputLength02 && bValidInputLength03 && bValidInputLength04) bValidInputLength = true; else bValidInputLength = false;  
                if (bValidInputLength == false) sMessage = "<font color=red><strong>Unvollst&auml;ndige Eingabe!</strong></font>";
                else if (bValidInput == false) sMessage = "<font color=red><strong>Ung&uuml;tige Zeichen gefunden!</strong></font>";
                else{
                  bSaveToEEPROM = true;
                  sMessage = "<font color=green><strong>Werte wurden gespeichert!</strong></font>";
                }
              }
 
              client.println("<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//DE\">");
              client.println("<html>");
              client.println("<head>");
              client.println("<link rel=\"shortcut icon\" href=\"data:image/x-icon;base64,");
              yield();
      			  client.println(String(Site_Picture));                           // Webpage Logo 16x16px
              yield();
              client.println("\" type=\"image/x-icon\" />");
              client.println("<title>Web Monitor</title>");
              client.println("</head>");
		  
      			  client.println("<body bgcolor=\"#adcede\">");
              client.println("<font color=\"#000000\" face=\"VERDANA,ARIAL,HELVETICA\">");
              client.println("<h1>");
              client.println("<img src=\"data:image/png;base64,");
              yield();
      			  client.println(String(WebMonitor_Picture));               // "Web Monitor" Picture 150x150px
              yield();
              client.println("\" hspace=10 align=\"middle\">");
              client.println("Web Monitor");
      			  client.println("</h1>");
              
              if (bShowFullSite == true){             
                client.println("<h2>Werte eingeben:</h2>");
                client.println("<form>");
                client.println("<table>");
                client.println("<colgroup>");
                client.println("<col width=\"20\">");
                client.println("<col width=\"180\">");
                client.println("<col width=\"300\">");
  			        client.println("<col width=\"150\">");
                client.println("</colgroup>");
  
        			  client.println("<tr>");
        			  client.println("<td></td>");
                client.println("<td><b>WLAN Name</b></td>");
                client.println("<td>");
                client.println("<input type=\"text\" style= \"width:250px\" name=\"SSID\" maxlength=\"32\" Value =\"");
                client.println(cWifi_Name);                              // Text-String des Eingebefeldes "WLAN Name" der Website
        			  client.println("\">");
        			  client.println("</td>");
                client.println("</tr>");
              		
        			  client.println("<tr>");
        			  client.println("<td></td>");
                client.println("<td><b>WLAN Passwort</b></td>");
                client.println("<td>");
                client.println("<input type=\"text\" style= \"width:250px\" name=\"PASSPHRASE\" maxlength=\"64\" Value =\"");
                client.println(cWifi_Password);                          // Text-String des Eingebefeldes "WLAN Passwort" der Website
        			  client.println("\">");
        			  client.println("</td>");
                client.println("</tr>");
              
         			  client.println("<tr>");
        			  client.println("<td></td>");
                client.println("<td><b>TR-064 User</b></td>");
                client.println("<td>");
                client.println("<input type=\"text\" style= \"width:250px\" name=\"TR064_USER\" maxlength=\"64\" Value =\"");
                client.println(cTR064_User);                             // Text-String des Eingebefeldes "TR-064 User" der Website
        			  client.println("\">");
        			  client.println("</td>");
                client.println("</tr>");

                 client.println("<tr>");
                client.println("<td></td>");
                client.println("<td><b>TR-064 Passwort</b></td>");
                client.println("<td>");
                client.println("<input type=\"text\" style= \"width:250px\" name=\"TR064_PASSWORD\" maxlength=\"64\" Value =\"");
                client.println(cTR064_Password);                         // Text-String des Eingebefeldes "TR-064 Passwort" der Website
                client.println("\">");
                client.println("</td>");
                client.println("</tr>");
                
                client.println("<tr>");
                client.println("<td></td>");
                client.println("<td><b>Download Speed</b></td>");
                client.println("<td>");
                client.println("<input type=\"text\" style= \"width:250px\" name=\"DL_SPEED\" maxlength=\"8\" Value =\"");
                client.println(cDL_Speed);                               // Text-String des Eingebefeldes "Download Speed" der Website
                client.println("\">");
                client.println("</td>");
                client.println("<td><b>MBit/s</b></td>");
                client.println("</tr>");
                
                client.println("<tr>");
                client.println("<td></td>");
                client.println("<td><b>Upload Speed</b></td>");
                client.println("<td>");
                client.println("<input type=\"text\" style= \"width:250px\" name=\"UL_SPEED\" maxlength=\"8\" Value =\"");
                client.println(cUL_Speed);                               // Text-String des Eingebefeldes "Upload Speed" der Website
                client.println("\">");
                client.println("</td>");
                client.println("<td><b>MBit/s</b></td>");
                client.println("</tr>");
              
        			  client.println("<tr>");
        			  client.println("<td></td>");
        			  client.println("<td></td>");
                client.println("<td>" + sMessage + "</td>");
                client.println("<td>");
                client.println("<button style=\"BACKGROUND-COLOR: yellow; width:200px; height:50px; border-radius:10px; border-width:3px;\" name=\"ACTION\" value=\"1\">");
        			  client.println("<strong>Alle Werte &uuml;bernehmen</strong> </button>");
        			  client.println("</td>");
                client.println("</tr>");
                
                client.println("</table>");

                yield();
        			  client.println(String(ExplanationText));                        // Webpage Erklärungstext zu Einstellungen
                yield();
                Serial.println("#############");
                client.println("</form>");
              }              
              client.println("</body");
			        client.println("</html>");
  
              // Die HTTP-Antwort wird mit einer Leerzeile beendet
              client.println();
              yield();

              // und wir verlassen mit einem break die Schleife
              break;
            } 
            else { // falls eine neue Zeile kommt, lösche die aktuelle Zeile
              currentLine = "";
            }
          } else if (c != '\r') {  // wenn etwas kommt was kein Zeilenumbruch ist,
            currentLine += c;      // füge es am Ende von currentLine an
          }
        }
      }
      // Die Header-Variable für den nächsten Durchlauf löschen
      HTTP_header = "";
      // Die Verbindung schließen
      client.stop();
      Serial.println("Client getrennt.");
      Serial.println("");
      yield();
      
      // eingelesene Einstellungen im EEPROM speichern
      if(bSaveToEEPROM == true){
        ESP.wdtFeed();
        WriteEEPROM();
        bSaveToEEPROM = false;
      }
    }
}

/*******************************************************************
 * Routine, um aus einem HHTP Rückgabestring die Werte aus eingebefeldern herauszufiltern
 * Übergabewerte: HTML-String und der zu suchende Schlüssel-String
 * Rückgabewert: String des zugehörigen Inhalts des vorgewählten Schlüssel-String
 *******************************************************************/
String ESP_Settings::PickValue(String HTML_String, String Search_String)
{
  if (HTML_String.indexOf("TR064_USER") >= 0) {
    int iHeaderPos = HTML_String.indexOf(Search_String);
    int iStartPos = HTML_String.indexOf("=", iHeaderPos) + 1;
    int iEndPos = HTML_String.indexOf("&", iHeaderPos);
    String sValue = HTML_String.substring(iStartPos, iEndPos);
    return sValue;
  }
  return "";
}

/*******************************************************************
 * Routine zur Überprüfung ob ASCII Sonderzeichen mit einem Wert > 127 in einem HTML String enthalten sind
 * Übergabewert: String mit zu überprüfenden ASCII Zeichen
 * Rückgabewert: True, wenn nur Zeichen 48..127  - False, wenn in Zeichen deutsche Umlaute enthalten sind
 *******************************************************************/
boolean ESP_Settings::HTML_noSpecialChar(String HTML2test)
{
  int iSpecialCharPos;
  iSpecialCharPos = HTML2test.indexOf("%");                           // find special ASCII sign
  if(iSpecialCharPos >= 0) return false;                              // return 'false' if a special ASCII sign is found
  return true;                                                        // return 'true' if no special ASCII signs are found
}

/*******************************************************************
 * Routine zur Überprüfung ob ASCII Sonderzeichen mit einem Wert > 127 in einem HTML String enthalten sind
 * Übergabewert: String mit zu überprüfenden ASCII Zeichen
 * Rückgabewert: True, wenn nur Zeichen 20..127  - False, wenn in Zeichen deutsche Umlaute enthalten sind
 *******************************************************************/
String ESP_Settings::HTML_RemoveSpecialChar(String HTML2test)
{
  String sQuotationMarks = (String)char(34);
  String sBackSlash = (String)char(92);
  
  HTML2test.replace("+", " ");                                 // Alle relevanten Sonderzeichen suchen und ersetzen
  HTML2test.replace("%20", " ");
  HTML2test.replace("%21", "!");
  HTML2test.replace("%22", sQuotationMarks);
  HTML2test.replace("%23", "#");
  HTML2test.replace("%24", "$");
  HTML2test.replace("%25", "%");
  HTML2test.replace("%26", "&");
  HTML2test.replace("%27", "'");
  HTML2test.replace("%28", "(");
  HTML2test.replace("%29", ")");
  HTML2test.replace("%2A", "*");
  HTML2test.replace("%2B", "+");
  HTML2test.replace("%2C", ",");
  HTML2test.replace("%2D", "-");
  HTML2test.replace("%2E", ".");
  HTML2test.replace("%2F", "/");
  HTML2test.replace("%3A", ":");
  HTML2test.replace("%3B", ";");
  HTML2test.replace("%3C", "<");
  HTML2test.replace("%3D", "=");
  HTML2test.replace("%3E", ">");
  HTML2test.replace("%3F", "?");
  HTML2test.replace("%40", "@");
  HTML2test.replace("%5B", "[");
  HTML2test.replace("%5C", sBackSlash);
  HTML2test.replace("%5D", "]");
  HTML2test.replace("%5E", "^");
  HTML2test.replace("%5F", "_");
  HTML2test.replace("%60", "`");
  HTML2test.replace("%7B", "{");
  HTML2test.replace("%7C", "|");
  HTML2test.replace("%7D", "}");
  HTML2test.replace("%7E", "~");
  return HTML2test;                                                   // return String without special characters
}

/*******************************************************************
 * Routine zur Umwandlung von UTF-8 kodierten Sonderzeichen in ASCII Zeichen
 * Übergabewert: String mit möglichen UTF-8 kodierten Zeichen
 * Rückgabewert: String mit zu ASCII umgewandelten Zeichen
 * ACHTUNG: Es werden 'echte' 1-Byte ASCII-Zeichen benutzt. Arduino nutzt für Umlaute normalerweise eine 2-Byte Codierung.
 *******************************************************************/
String ESP_Settings::UTF8toASCII(String sUTF8)
{
  String sHex;
  String sChar;
  byte bAscDezimal;
  int iSpecialCharPos;
  iSpecialCharPos = sUTF8.indexOf("%");                               // find special ASCII sign
  while(iSpecialCharPos >= 0){                                        // do while more special ASCII signs are found
    sHex = sUTF8.substring(iSpecialCharPos + 1, iSpecialCharPos + 3); // isolate the Hex-String for the ASCII sign
    bAscDezimal = (byte)strtoul(sHex.c_str(), NULL, 16);              // convertin Hex-String to decimal Byte value
    sChar = char(bAscDezimal);                                        // ASCII character to string
    sUTF8.replace("%" + sHex, sChar);                                 // replace special ASCII sign
    iSpecialCharPos = sUTF8.indexOf("%");                             // search for next special ASCII sign
  }
  return sUTF8;
}

/*******************************************************************
 * Routine zur Umwandlung von ASCII Sonderzeichen in UTF-8 kodierte Zeichen
 * Übergabewert: String mit möglichen Sonderzeichen im ASCII Format umgewandelten Zeichen String mit möglichen UTF-8 kodierten Zeichen
 * Rückgabewert: String mit umgewandelten UTF-8 kodierten Zeichen
 * ACHTUNG: Es werden 'echte' 1-Byte ASCII-Zeichen benutzt. Arduino nutzt für Umlaute normalerweise eine 2-Byte Codierung.
 *******************************************************************/
String ESP_Settings::ASCIItoUTF8(String ASCII_String)
{
  String sUnicode;
  String sFirstStr;
  String sSecondStr;
  char   cASCII;
  byte   bASCII;
   
  for (int i = ASCII_String.length(); i >= 0; i--){                   // search for character backwards in the string
    cASCII = ASCII_String.charAt(i);                                  // read selected character
    bASCII = (byte)cASCII;                                            // ASCII decimal value of the selected character
    if (bASCII > 127){                                                // if ASCII decimal value = special character
      sUnicode = String(bASCII, HEX);                                 // convert decimal to hex-string
      sUnicode.toUpperCase();                                         // comvert string to uppercase
      sUnicode = "&#" + sUnicode + ";";                               // create unicode string
      sFirstStr = ASCII_String.substring(0, i);                       // extract string up to the selected character
      sSecondStr = ASCII_String.substring(i+1);                       // extract string from the selected character to the end
      ASCII_String = sFirstStr + sUnicode + sSecondStr;               // build the new complete string
    }
    return ASCII_String;
  }
}

/*******************************************************************
 * Routine zum Löschen der definierten 512 Byte des internen EEPROM
 *******************************************************************/
void ESP_Settings::DeleteEEPROM(){
  char cDummy32[33] = "";
  char cDummy64[65] = "";
  byte bDummy04[4] = {0, 0, 0, 0};
  
