Joerg-66/ESP8266-WebMonitor/Software/WebMonitor_1-3/ESP_Settings.cpp
  for (int i=0; i<33; ++i) cDummy32[i] = '\n';
  for (int i=0; i<65; ++i) cDummy64[i] = '\n';
  EEPROM.begin(512);
  EEPROM.put(0x0000, cDummy32);
  delay(200);
  EEPROM.put(0x0040, cDummy64);
  delay(200);
  EEPROM.put(0x00C0, cDummy64);
  delay(200);
  EEPROM.put(0x0140, cDummy64);
  delay(200);
  EEPROM.put(0x01C0, bDummy04);
  delay(200);
  EEPROM.put(0x01D0, bDummy04);
  delay(200);
  EEPROM.commit();            // Only needed for ESP8266 to get data written
  EEPROM.end();               // Free RAM copy of structure 
}

/*******************************************************************
 * Routine zum Schreiben aller Eingebewerte ins interne EEPROM
 *******************************************************************/
void ESP_Settings::WriteEEPROM(){
  EEPROM.begin(512);
  EEPROM.put(0x0000, cWifi_Name);
  delay(200);
  EEPROM.put(0x0040, cWifi_Password);
  delay(200);
  EEPROM.put(0x00C0, cTR064_User);
  delay(200);
  EEPROM.put(0x0140, cTR064_Password);
  delay(200);
  bDL_Speed[0] = (byte)((ulDL_Speed >> 24) & 0xFF) ;
  bDL_Speed[1] = (byte)((ulDL_Speed >> 16) & 0xFF) ;
  bDL_Speed[2] = (byte)((ulDL_Speed >> 8) & 0XFF);
  bDL_Speed[3] = (byte)((ulDL_Speed & 0XFF));
  EEPROM.put(0x01C0, bDL_Speed);
  delay(200);
  bUL_Speed[0] = (byte)((ulUL_Speed >> 24) & 0xFF) ;
  bUL_Speed[1] = (byte)((ulUL_Speed >> 16) & 0xFF) ;
  bUL_Speed[2] = (byte)((ulUL_Speed >> 8) & 0XFF);
  bUL_Speed[3] = (byte)((ulUL_Speed & 0XFF));
  EEPROM.put(0x01D0, bUL_Speed);
  delay(200);
  EEPROM.commit();            // Only needed for ESP8266 to get data written
  EEPROM.end();               // Free RAM copy of structure
}

/*******************************************************************
 * Routine zum Auslesen des WLAN Namens aus dem EEPROM
 *******************************************************************/
String ESP_Settings::Read_WifiSSID(void)
{
  EEPROM.begin(512);
  EEPROM.get(0x0000, cWifi_Name);
  EEPROM.end();
  return String(cWifi_Name);
}

/*******************************************************************
 * Routine zum Auslesen des WLAN Passwortes aus dem EEPROM
 *******************************************************************/
String ESP_Settings::Read_WifiPassword(void)
{
  EEPROM.begin(512);
  EEPROM.get(0x0040, cWifi_Password);
  EEPROM.end();
  return String(cWifi_Password);
}

/*******************************************************************
 * Routine zum Auslesen des TR-064 Users aus dem EEPROM
 *******************************************************************/
String ESP_Settings::Read_TR064_User(void)
{
  EEPROM.begin(512);
  EEPROM.get(0x00C0, cTR064_User);
  EEPROM.end();
  return String(cTR064_User);
}

/*******************************************************************
 * Routine zum Auslesen des TR-064 Passwortes aus dem EEPROM
 *******************************************************************/
String ESP_Settings::Read_TR064_Password(void)
{
  EEPROM.begin(512);
  EEPROM.get(0x0140, cTR064_Password);
  EEPROM.end();
  return String(cTR064_Password);
}

/*******************************************************************
 * Routine zum Auslesen der max. Download Geschwindigkeit in kByte/s
 *******************************************************************/
unsigned long ESP_Settings::Read_Download_Speed(void)
{
  EEPROM.begin(512);
  EEPROM.get(0x01C0, bDL_Speed);
  EEPROM.end();
  ulDL_Speed = (((unsigned long)bDL_Speed[0] << 24) 
              + ((unsigned long)bDL_Speed[1] << 16) 
              + ((unsigned long)bDL_Speed[2] << 8) 
              + ((unsigned long)bDL_Speed[3] ));
  return ulDL_Speed;
}

/*******************************************************************
 * Routine zum Auslesen der max. Upload Geschwindigkeit in kByte/s
 *******************************************************************/
unsigned long ESP_Settings::Read_Upload_Speed(void)
{
  EEPROM.begin(512);
  EEPROM.get(0x01D0, bUL_Speed);
  EEPROM.end();
  ulUL_Speed = (((unsigned long)bUL_Speed[0] << 24) 
              + ((unsigned long)bUL_Speed[1] << 16) 
              + ((unsigned long)bUL_Speed[2] << 8) 
              + ((unsigned long)bUL_Speed[3] ));
  return ulUL_Speed;
}
